

author = 'Козлов Григорий Сергеевич'

# Задача-1: Запросите у пользователя ввод произвольного целого числа
# Вывести самую большую цифру этого числа.
# Например, дается x = 58375.
# Нужно вывести максимальную цифру в данном числе, т.е. 8.
# Число приходит в виде целого беззнакового.

#number = input("Введите целое число: ")
#list = [int(x) for x in str(number)]
#largest = max(list)
#print(largest)

#python HW1normal
# Задача-2: Запросить у пользователя два целых числа, связать их с переменными.
# Поменять значения переменных местами. Вывести новые значения на экран.
# Решите задачу, используя только две переменные.

#a = input("Введите число 1: ")
#b = input("Введите число 2: ")
#a, b = b, a
#print(a, b)

# Задача-3: Напишите программу, вычисляющую корни квадратного уравнения вида
# ax2 + bx + c = 0.
# Для вычисления квадратного корня воспользуйтесь функцией sqrt() модуля math
# import math
# math.sqrt(4) - вычисляет корень числа 4

#import math
#a = float(input("enter a"))
#b = float(input("enter b"))
#c = float(input("enter c"))

#discr = float(b**2 - 4 * a * c)
#print(discr)

#if discr > 0:
#   x1 = (-b + math.sqrt(discr)) / (2 * a)
#   x2 = (-b - math.sqrt(discr)) / (2 * a)
#  print("x1 = ", round(x1, 2), "x2 = ", round(x2, 2))
#elif discr == 0:
#   x = -b / 2 * a
#else:
#    print("No roots")




